# Procesamiento y transferencia de datos

## 1.1 Carga de información
Cargamos los datos desde el archivo. Insepeccionamos en busca de anomalías

In [76]:
import pandas as pd
import numpy as np

In [77]:
data_pt = pd.read_csv("./data_prueba_técnica.csv")
data_pt.head()

,id,name,company_id,amount,status,created_at,paid_at
0,48ba4bdbfb56ceebb32f2bd0263e759be942af3d,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.00,voided,2019-03-19,NaN
1,05fc6f5ac66b6ee7e4253aa5d0c2299eb47aaaf4,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.00,pending_payment,2019-05-06,NaN
2,2cdce231c1fc6a2061bfa2f1d978351fe217245d,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.00,voided,2019-02-22,NaN
3,81633ba310a50b673efd469c37139576982901aa,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,102.61,paid,2019-02-27,2019-02-27
4,6ccfc4c24e788e4bca448df343698782db6b0c0b,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,184.49,paid,2019-02-05,2019-02-05

In [78]:
data_pt.info()

<class 'pandas.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          9997 non-null   str
 1   name        9997 non-null   str
 2   company_id  9996 non-null   str
 3   amount      10000 non-null  float64
 4   status      10000 non-null  str
 5   created_at  10000 non-null  str
 6   paid_at     6009 non-null   str
dtypes: float64(1), str(6)
memory usage: 547.0 KB

In [79]:
data_pt.describe()

/home/eeloc37/Documentos/prueba-técnica/.venv/lib/python3.14/site-packages/pandas/core/nanops.py:1020: RuntimeWarning: invalid value encountered in subtract
  sqr = _ensure_numeric((avg - values) ** 2)

           amount
count  10000.0000
mean          inf
std           NaN
min        2.9900
25%       31.2100
50%       60.6150
75%      109.5825
max           inf

In [80]:
inf_values_num = np.isinf(data_pt['amount']).sum()
print(f'Existe(n) {int(inf_values_num)} valores infinitos')
data_pt[np.isinf(data_pt['amount'])]

Existe(n) 1 valores infinitos

,id,name,company_id,amount,status,created_at,paid_at
1752,94f33d3d5a142c7dfcbf247806ad68cf1dc93515,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,inf,voided,2019-02-11,NaN

In [81]:
data_pt = data_pt.replace([np.inf, -np.inf], np.nan, inplace=True)
data_pt.describe()

             amount
count  9.999000e+03
mean   3.000300e+30
std    3.000150e+32
min    2.990000e+00
25%    3.121000e+01
50%    6.061000e+01
75%    1.095700e+02
max    3.000000e+34

In [82]:
missing_data = data_pt.isnull().sum()
missing_data

id               3
name             3
company_id       4
amount           1
status           0
created_at       0
paid_at       3991
dtype: int64

In [83]:
data_pt[data_pt['id'].isnull()]

,id,name,company_id,amount,status,created_at,paid_at
272,NaN,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,66.16,pending_payment,2019-03-14,NaN
9915,NaN,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,55.71,paid,2019-02-13,2019-02-13
9917,NaN,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,89.36,paid,2019-04-17,2019-04-17

In [84]:
data_pt[data_pt['company_id'].isnull()]

,id,name,company_id,amount,status,created_at,paid_at
262,6b77d36f2ebd5e53a76195c6c1678a5027022f9d,MiPasajefy,NaN,3.00,pending_payment,2019-02-01,NaN
2378,28445567bf15d6751367e3828f39c255546cc1e1,MiPasajefy,NaN,3.00,pending_payment,2019-03-23,NaN
2445,654695699dc08392248aedef372f64f0284ecb68,MiPasajefy,NaN,30.80,paid,2019-03-27,2019-03-27
5981,6f6e718b9993ac97ff6e19c61498fb8be82320df,MiPasajefy,NaN,69.55,voided,2019-05-10,NaN

In [85]:
cells_num = np.prod(data_pt.shape)
missing_cells_num = missing_data.sum()
missing_data_percentage = (missing_cells_num / cells_num) * 100
print(f'Porcentaje de valores nulos en columna alguna columna: {round(missing_data_percentage, 2)}%')

Porcentaje de valores nulos en columna alguna columna: 5.72%

In [86]:
data_pt = data_pt.dropna(subset=['id', 'company_id', 'amount'])
data_pt.info()

<class 'pandas.DataFrame'>
Index: 9992 entries, 0 to 9999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          9992 non-null   str
 1   name        9989 non-null   str
 2   company_id  9992 non-null   str
 3   amount      9992 non-null   float64
 4   status      9992 non-null   str
 5   created_at  9992 non-null   str
 6   paid_at     6006 non-null   str
dtypes: float64(1), str(6)
memory usage: 624.5 KB

In [ ]:
data_pt.to_csv('data_prueba_tecnica_extracted.csv',index=False)